tutorials/incompressibleVoF/propeller/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        innerCylinder;

    solidBodyMotionFunction
    {
        type            rotatingMotion;

        origin          (0 0 0);
        axis            (0 1 0);

        omega
        {
            type        table;
            units       ([s] [rpm]);
            values
            (
                (0     0)
                (0.01  6000)
                (0.022 6000)
                (0.03  4000)
                (100   4000)
            );
        }
    }
}


// ************************************************************************* //
