tutorials/incompressibleVoF/propeller/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

VoFCavitation
{
    type    VoFCavitation;

    model   SchnerrSauer;

    Kunz
    {
        pSat    2300;   // Saturation pressure

        liquid  water;

        UInf    20.0;
        tInf    0.005; // L = 0.1 m
        Cc      1000;
        Cv      1000;
    }

    Merkle
    {
        pSat    2300;   // Saturation pressure

        liquid  water;

        UInf    20.0;
        tInf    0.005;  // L = 0.1 m
        Cc      80;
        Cv      1e-03;
    }

    SchnerrSauer
    {
        pSat    2300;   // Saturation pressure

        liquid  water;

        n       1.6e+13;
        dNuc    2.0e-06;
        Cc      1;
        Cv      1;
    }
}


// ************************************************************************* //
